In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('SuperMarket_Transaction_Data.csv')

In [5]:
df.head()

                                                                                                          Table 1
Invoice_id  Cust_id Txn_date Product_Sub_category Product_Category Qty Rate  Tax    Total_Amt Store_type      NaN
25890929042 266783  9/23/16  Women                Footwear         4   1321  554.82 5838.82   e-Shop          NaN
                    9/24/16  Women                Footwear         -4  -1321 554.82 -5838.82  e-Shop          NaN
98477711300 266783  10/21/17 Mens                 Clothing         3   93    29.295 308.295   TeleShop        NaN
8410316370  266783  2/20/18  Mens                 Clothing         1   869   91.245 960.245   e-Shop          NaN

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 21989 entries, ('Invoice_id', 'Cust_id', 'Txn_date', 'Product_Sub_category', 'Product_Category', 'Qty', 'Rate', 'Tax', 'Total_Amt', 'Store_type') to ('24113900219', '275265', '3/4/18', 'Furnishing', 'Home and kitchen', '3', '719', '226.485', '2383.485', 'Brick and Mortar')
Data columns (total 1 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Table 1  0 non-null      float64
dtypes: float64(1)
memory usage: 1.8+ MB

In [7]:
df = pd.read_csv('SuperMarket_Transaction_Data.csv', sep='\t')